In [1]:
import pandas as pd
import janitor as jn
import numpy as np
from janitor.functions._numba import _numba_less_than, _numba_greater_than

In [2]:
# url = 'https://raw.githubusercontent.com/samukweku/data-wrangling-blog/master/notebooks/Data_files/results.csv'
# events = pd.read_csv(url, parse_dates=['start', 'end']).iloc[:, 1:]
# events.head()

In [3]:
# %%timeit
# (events
# .conditional_join(
#     events,
#     ('end', 'start', '>='),
#     ('start', 'end', '<='),
#     # ('id', 'id', '!='),
#     use_numba = False,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [4]:
# %%timeit
# (events
# .conditional_join(
#     events,
#     ('end', 'start', '>='),
#     ('start', 'end', '<='),
#     # ('id', 'id', '!='),
#     use_numba = True,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [5]:
# (events
# .conditional_join(
#     events,
#     ('end', 'start', '>='),
#     ('start', 'end', '<='),
#     # ('id', 'id', '!='),
#     use_numba = True,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [6]:
# (events
# .conditional_join(
#     events,
#     ('start', 'end', '<='),
#     ('end', 'start', '>='),
#     ('id', 'id', '!='),
#     use_numba = True,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [7]:
# %%timeit
# (events
# .conditional_join(
#     events,
#     ('start', 'end', '<='),
#     ('end', 'start', '>='),
#     ('id', 'id', '!='),
#     use_numba = True,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [8]:
# %%timeit
# (events
# .conditional_join(
#     events,
#     ('start', 'end', '<='),
#     ('end', 'start', '>='),
#     ('id', 'id', '!='),
#     use_numba = False,
#     df_columns = ['id', 'start', 'end'],
#     right_columns = ['id', 'start', 'end'])
# )

In [9]:

C=dict(key=[f"c{num}" for num in range(1,8)],
       vol=[35,15,5,35,18,90,17],
       profit=[45,35,55,12,15,55,11],
       unitsSold=[15,10,30,10,15,80,2]
       )
C=pd.DataFrame(C)


D=dict(key=[f'd{num}' for num in range(1,9)],
       vol=[20,50,15,16,40,20,40,2],
       profit=[30,10,12,52,35,20,30,57],
       unitsSold=[20,35,10,12,40,30,5,15]
       )
D=pd.DataFrame(D)

In [10]:
C

  key  vol  profit  unitsSold
0  c1   35      45         15
1  c2   15      35         10
2  c3    5      55         30
3  c4   35      12         10
4  c5   18      15         15
5  c6   90      55         80
6  c7   17      11          2

In [11]:
D

  key  vol  profit  unitsSold
0  d1   20      30         20
1  d2   50      10         35
2  d3   15      12         10
3  d4   16      52         12
4  d5   40      35         40
5  d6   20      20         30
6  d7   40      30          5
7  d8    2      57         15

In [12]:
# C = pd.concat([C]*10_000)
# D = pd.concat([D]*1_000)

In [13]:
# rar=C.conditional_join(D, ('vol','vol','<'),('profit','profit','>'),use_numba=True)[0]
# rar[np.argsort(rar[:,1])]

In [14]:
C.conditional_join(D, ('profit','profit','>'),('vol','vol','<'),use_numba=False)

   left                      right
    key vol profit unitsSold   key vol profit unitsSold
0    c1  35     45        15    d2  50     10        35
1    c1  35     45        15    d7  40     30         5
2    c1  35     45        15    d5  40     35        40
3    c2  15     35        10    d2  50     10        35
4    c2  15     35        10    d6  20     20        30
5    c2  15     35        10    d1  20     30        20
6    c2  15     35        10    d7  40     30         5
7    c3   5     55        30    d2  50     10        35
8    c3   5     55        30    d3  15     12        10
9    c3   5     55        30    d6  20     20        30
10   c3   5     55        30    d1  20     30        20
11   c3   5     55        30    d7  40     30         5
12   c3   5     55        30    d5  40     35        40
13   c3   5     55        30    d4  16     52        12
14   c4  35     12        10    d2  50     10        35
15   c5  18     15        15    d2  50     10        35
16   c7  17     11         2    d2  50     10        35

In [15]:
# C.conditional_join(D, ('vol','vol','<'),('profit','profit','>'),use_numba=True)

In [16]:
# C.conditional_join(D, ('profit','profit','>'),('vol','vol','<'),use_numba=True)

In [17]:
# C.conditional_join(D, ('vol','vol','<'),('profit','profit','>'),use_numba=False, keep='first')

In [18]:
# C.conditional_join(D, ('vol','vol','<'),('profit','profit','>'),use_numba=True, keep='last')

In [19]:
# C.conditional_join(D, ('profit','profit','>'),('vol','vol','<'),use_numba=False)

In [6]:
df1 = pd.DataFrame({"id": [1, 1, 1, 2, 2, 3], "value_1": [2, 5, 7, 1, 23, 4]})
df2 = pd.DataFrame(
    {
        "id": [1, 1, 1, 1, 2, 2, 2, 3],
        "value_2A": [0, 3, 7, 12, 0, 2, 3, 1],
        "value_2B": [1, 5, 9, 15, 1, 4, 6, 3],
    }
)

In [21]:
df1

   id  value_1
0   1        2
1   1        5
2   1        7
3   2        1
4   2       23
5   3        4

In [22]:
df2

   id  value_2A  value_2B
0   1         0         1
1   1         3         5
2   1         7         9
3   1        12        15
4   2         0         1
5   2         2         4
6   2         3         6
7   3         1         3

In [23]:
# df1.conditional_join(
#     df2,
#     ("value_1", "value_2B", "<"),
#     ("value_1", "value_2A", ">"),
#     use_numba=False,
#     keep="last",
# )

In [24]:
# df1.conditional_join(
#     df2,
#     ("value_1", "value_2B", "<"),
#     ("value_1", "value_2A", ">"),
#     use_numba=True,
#     keep="last",
# )

In [25]:
# df1.conditional_join(
#     df2,
#     ("value_1", "value_2A", ">"),
#     ("value_1", "value_2B", "<"),
#     use_numba=True,
#     keep="last",
# )

In [26]:
# df1.conditional_join(df2, ('value_1', 'value_2A','>'), ('value_1','value_2B', '<'), use_numba=False,keep='all')

In [27]:
df = {
    "A": [0],
    "B": [0.0],
    "C": [""],
    "D": [False],
    "E": [pd.to_datetime("1970-01-01")],
}
df = pd.DataFrame(df)
df

   A    B C      D          E
0  0  0.0    False 1970-01-01

In [28]:
right = {
    "Integers": [0],
    "Numeric": [0.0],
    "Floats": [0.0],
    "Strings": [""],
    "Booleans": [False],
    "Date": [pd.to_datetime("1970-01-01")],
    "Dates_Right": [pd.to_datetime("1970-01-01")],
}
right = pd.DataFrame(right)
right

   Integers  Numeric  Floats Strings  Booleans       Date Dates_Right
0         0      0.0     0.0             False 1970-01-01  1970-01-01

In [29]:
expected = pd.merge_asof(
        df[["B"]],
        right[["Numeric"]].sort_values("Numeric").dropna(subset=["Numeric"]),
        left_on="B",
        right_on="Numeric",
        direction="backward",
        allow_exact_matches=False,
    )
expected

     B  Numeric
0  0.0      NaN

In [30]:
df = df.sort_values("B").dropna(subset=["B"])
(
        df[["B"]]
        .conditional_join(
            right[["Numeric"]].sort_values("Numeric"),
            ("B", "Numeric", ">"),
            how="left",
            keep="last",
            use_numba=True,
        )
        # .sort_values(["B", "Numeric"], ignore_index=True)
    )

     B  Numeric
0  0.0      NaN

In [31]:
# # df = df.sort_values("B").dropna(subset=["B"])
# actual = (
#         df[["A"]]
#         .conditional_join(
#             right[["Integers"]],
#             ("A", "Integers", "<"),
#             how="inner",
#             # keep="first",
#             use_numba=True,
#         )
#         # .sort_values(["A", "Integers"], ignore_index=True)
#     )

# actual

In [32]:
# (
#         df[["A"]]
#         .conditional_join(
#             right[["Integers"]],
#             ("A", "Integers", "<"),
#             how="inner",
#             # keep="first",
#             use_numba=False,
#         )
#      #   .sort_values(["B", "Numeric"], ignore_index=True)
#     )

In [33]:
# (
#         df[["A"]]
#         .merge(right[["Integers"]], how="cross")
#         .loc[lambda df: df.A.lt(df.Integers)]
#         .sort_values(["A", "Integers"], ignore_index=True)
#     )